In [1]:
import pandas as pd
import glob
from datetime import datetime

In [2]:
search_dict = 'Data/Bus systems/0307'
files = glob.glob(search_dict + '/*.csv')

In [3]:
df = pd.concat(map(pd.read_csv, files))
df

,BUSDATA_ID,DEAL_TYPE,DEAL_SEQ_NUM,DEAL_TIME,SAM_CODE,CITY_CODE,BUSINESS_CODE,GRANT_CARD_CODE,CARD_TYPE,MONTH_TICKET_TYPE,...,VAL_FLAG,CREATEDATE,UPDATEDATE,BL_COMP_CODE,RUN_COMP_CODE,LOW_COMP_CODE,BUS_GROUP_CODE,GET_POINT_CODE,POS_CODE,UP_TIME
0,18305348846,0,34829,20160307000351,300005247,1000,7510,14992361,1,7,...,NaN,20160308201736,20160308201736,75101500,0,0,6152,0,0,19700101010101
1,18305346187,0,34829,20160307000353,300005247,1000,7510,30956492,1,7,...,NaN,20160308201736,20160308201736,75101500,0,0,6152,0,0,19700101010101
2,18305342641,0,7069,20160307000426,300006920,1000,7511,17412757,1,7,...,NaN,20160308201736,20160308201736,75101500,0,0,6152,0,0,19700101010101
3,18305353584,6,64767,20160307000541,300010879,1000,7511,17412757,1,7,...,NaN,20160308201736,20160308201736,75101500,0,0,6152,0,0,20160307000401
4,18308701601,0,6933,20160307000549,300006123,1000,7510,88586747,1,1,...,NaN,20160308204612,20160308204612,75100800,0,0,4360,0,0,19700101010101
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19327,18320090286,6,97327,20160307232316,300031701,1000,7510,65982527,1,120,...,NaN,20160309172732,20160309172732,75100600,0,0,1798,0,0,20160307231201
19328,18320081727,6,97328,20160307232342,300031701,1000,7510,68195503,1,120,...,NaN,20160309172732,20160309172732,75100600,0,0,1798,0,0,20160307231201
19329,18320025717,6,93039,20160307233047,300025564,1000,7510,19225103,1,0,...,NaN,20160309172732,20160309172732,75100600,0,0,1798,0,0,20160307230901
19330,18320012647,6,5379,20160307233224,18658,1000,7511,11030462,1,120,...,NaN,20160309172732,20160309172732,75100600,0,0,1798,0,0,20160307230901
19331,18320017182,6,93040,20160307233503,300025564,1000,7511,15886088,1,120,...,NaN,20160309172732,20160309172732,75100600,0,0,1798,0,0,20160307231001

In [4]:
drop_cols = ['CITY_CODE', 'DRIVER_CODE', 'CHECKER_CODE', 'VAL_FLAG', 'RUN_COMP_CODE', 'LOW_COMP_CODE', 'GET_POINT_CODE', 'POS_CODE', 'UP_TIME']

df = df.drop(drop_cols, axis=1)
df

,BUSDATA_ID,DEAL_TYPE,DEAL_SEQ_NUM,DEAL_TIME,SAM_CODE,BUSINESS_CODE,GRANT_CARD_CODE,CARD_TYPE,MONTH_TICKET_TYPE,LINE_CODE,VEHICLE_CODE,ON_STATION,OFF_STATION,CREATEDATE,UPDATEDATE,BL_COMP_CODE,BUS_GROUP_CODE
0,18305348846,0,34829,20160307000351,300005247,7510,14992361,1,7,10,940702,9,9,20160308201736,20160308201736,75101500,6152
1,18305346187,0,34829,20160307000353,300005247,7510,30956492,1,7,10,940702,9,9,20160308201736,20160308201736,75101500,6152
2,18305342641,0,7069,20160307000426,300006920,7511,17412757,1,7,10,940702,7,7,20160308201736,20160308201736,75101500,6152
3,18305353584,6,64767,20160307000541,300010879,7511,17412757,1,7,10,940702,7,9,20160308201736,20160308201736,75101500,6152
4,18308701601,0,6933,20160307000549,300006123,7510,88586747,1,1,10,940157,10,10,20160308204612,20160308204612,75100800,4360
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19327,18320090286,6,97327,20160307232316,300031701,7510,65982527,1,120,94,67831,6,1,20160309172732,20160309172732,75100600,1798
19328,18320081727,6,97328,20160307232342,300031701,7510,68195503,1,120,94,67831,6,1,20160309172732,20160309172732,75100600,1798
19329,18320025717,6,93039,20160307233047,300025564,7510,19225103,1,0,94,67833,14,14,20160309172732,20160309172732,75100600,1798
19330,18320012647,6,5379,20160307233224,18658,7511,11030462,1,120,94,67833,14,13,20160309172732,20160309172732,75100600,1798
19331,18320017182,6,93040,20160307233503,300025564,7511,15886088,1,120,94,67833,14,13,20160309172732,20160309172732,75100600,1798

In [5]:
datetime_cols = ['DEAL_TIME', 'CREATEDATE', 'UPDATEDATE']
date_format = '%Y%m%d%H%M%S'

for col in datetime_cols:
    df[col] = df[col].apply(lambda val: datetime.strptime(str(val), date_format))
df

,BUSDATA_ID,DEAL_TYPE,DEAL_SEQ_NUM,DEAL_TIME,SAM_CODE,BUSINESS_CODE,GRANT_CARD_CODE,CARD_TYPE,MONTH_TICKET_TYPE,LINE_CODE,VEHICLE_CODE,ON_STATION,OFF_STATION,CREATEDATE,UPDATEDATE,BL_COMP_CODE,BUS_GROUP_CODE
0,18305348846,0,34829,2016-03-07 00:03:51,300005247,7510,14992361,1,7,10,940702,9,9,2016-03-08 20:17:36,2016-03-08 20:17:36,75101500,6152
1,18305346187,0,34829,2016-03-07 00:03:53,300005247,7510,30956492,1,7,10,940702,9,9,2016-03-08 20:17:36,2016-03-08 20:17:36,75101500,6152
2,18305342641,0,7069,2016-03-07 00:04:26,300006920,7511,17412757,1,7,10,940702,7,7,2016-03-08 20:17:36,2016-03-08 20:17:36,75101500,6152
3,18305353584,6,64767,2016-03-07 00:05:41,300010879,7511,17412757,1,7,10,940702,7,9,2016-03-08 20:17:36,2016-03-08 20:17:36,75101500,6152
4,18308701601,0,6933,2016-03-07 00:05:49,300006123,7510,88586747,1,1,10,940157,10,10,2016-03-08 20:46:12,2016-03-08 20:46:12,75100800,4360
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19327,18320090286,6,97327,2016-03-07 23:23:16,300031701,7510,65982527,1,120,94,67831,6,1,2016-03-09 17:27:32,2016-03-09 17:27:32,75100600,1798
19328,18320081727,6,97328,2016-03-07 23:23:42,300031701,7510,68195503,1,120,94,67831,6,1,2016-03-09 17:27:32,2016-03-09 17:27:32,75100600,1798
19329,18320025717,6,93039,2016-03-07 23:30:47,300025564,7510,19225103,1,0,94,67833,14,14,2016-03-09 17:27:32,2016-03-09 17:27:32,75100600,1798
19330,18320012647,6,5379,2016-03-07 23:32:24,18658,7511,11030462,1,120,94,67833,14,13,2016-03-09 17:27:32,2016-03-09 17:27:32,75100600,1798
19331,18320017182,6,93040,2016-03-07 23:35:03,300025564,7511,15886088,1,120,94,67833,14,13,2016-03-09 17:27:32,2016-03-09 17:27:32,75100600,1798

In [10]:
unique_passengers = df.groupby(by='GRANT_CARD_CODE', group_keys=True)
len(unique_passengers)

422236

In [19]:
for key, item in unique_passengers:
    if len(item.index) > 2:
        display(item)
        break

,BUSDATA_ID,DEAL_TYPE,DEAL_SEQ_NUM,DEAL_TIME,SAM_CODE,BUSINESS_CODE,GRANT_CARD_CODE,CARD_TYPE,MONTH_TICKET_TYPE,LINE_CODE,VEHICLE_CODE,ON_STATION,OFF_STATION,CREATEDATE,UPDATEDATE,BL_COMP_CODE,BUS_GROUP_CODE
11559,18311432256,0,9661,2016-03-07 16:57:59,100002992,7510,1081,1,2,360,430246,9,9,2016-03-08 21:11:37,2016-03-08 21:11:37,75101400,4353
11568,18311421754,6,9662,2016-03-07 16:58:12,100002992,7510,1081,1,0,360,430246,9,10,2016-03-08 21:11:37,2016-03-08 21:11:37,75101400,4353
17803,18326430549,0,9331,2016-03-07 19:43:42,200000649,7510,1081,1,17,361,121115,9,9,2016-03-09 18:23:41,2016-03-09 18:23:41,75101300,1796
17948,18319040986,6,62443,2016-03-07 19:53:31,300017806,7510,1081,1,0,361,121115,9,12,2016-03-09 17:16:43,2016-03-09 17:16:43,75100500,769
35429,18323078645,0,32,2016-03-07 19:16:21,600000713,7510,1081,1,0,425,990130,2,2,2016-03-09 17:57:43,2016-03-09 17:57:43,75100800,4616
36567,18341115820,6,294,2016-03-07 19:42:05,700002159,7510,1081,1,0,425,990130,2,10,2016-03-10 18:02:32,2016-03-10 18:02:32,75100800,4616